initial/0/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0;
boundaryField
{
	outlet
	{
		type	zeroGradient;
	}
	left
	{
		type	cyclicAMI;
	}
	right
	{
		type	cyclicAMI;
	}
	inlet
	{
		type	totalPressure;
		p0	uniform 0;
		gamma	0;
	}
	propeller
	{
		type	zeroGradient;
	}
	external
	{
		type	totalPressure;
		p0	uniform 0;
		gamma	0;
	}
}
