initial/system/snappyHexMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	snappyHexMeshDict;
}
castellatedMesh	true;
snap	true;
addLayers	true;
geometry
{
	external.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	cylinder;
		name	external;
		point1	(-0.001 0 0);
		point2	(1.5009999 0 0);
		radius	1.0;
		faceGroups
		{
			cylinder
			{
				name	external;
			}
			disk1
			{
				name	external;
			}
			disk2
			{
				name	external;
			}
		}
	}
	propeller.stl
	{
		type	triSurfaceMesh;
		simflowType	stl;
		name	propeller;
		includedAngle	120.0;
	}
	refine.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	cylinder;
		name	refine;
		point1	(-0.001 0 0);
		point2	(1.5009999 0 0);
		radius	0.3;
		faceGroups
		{
			cylinder
			{
				name	refine;
			}
			disk1
			{
				name	refine;
			}
			disk2
			{
				name	refine;
			}
		}
	}
}
castellatedMeshControls
{
	locationInMesh	(0.5 0.5 0.5);
	refinementSurfaces
	{
		external
		{
			level	( 0 0 );
			patchInfo
			{
				type	wall;
			}
		}
		propeller
		{
			level	( 3 4 );
			patchInfo
			{
				type	wall;
			}
		}
	}
	refinementRegions
	{
		refine
		{
			mode	inside;
			levels	((1.0E30 2));
		}
	}
	limitRegions
	{
	}
	features	
	(
	{
		file	"external.eMesh";
		levels	((0 0));
	}
	{
		file	"propeller.eMesh";
		levels	((0 0));
	}
	);
	maxLocalCells	1000000;
	maxGlobalCells	10000000;
	nCellsBetweenLevels	4;
	maxLoadUnbalance	0.1;
	minRefinementCells	10;
	resolveFeatureAngle	30.0;
	allowFreeStandingZoneFaces	true;
}
snapControls
{
	tolerance	1.0;
	nSmoothPatch	3;
	nSolveIter	500;
	nRelaxIter	5;
	nFeatureSnapIter	10;
	implicitFeatureSnap	false;
	explicitFeatureSnap	true;
	multiRegionFeatureSnap	true;
	nFaceSplitInterval	5;
}
addLayersControls
{
	layers
	{
		propeller
		{
			nSurfaceLayers	5;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		propeller_patch0
		{
			nSurfaceLayers	5;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
	}
	relativeSizes	true;
	minThickness	0.1;
	firstLayerThickness	0.2;
	expansionRatio	1.25;
	nGrow	0;
	featureAngle	180.0;
	maxFaceThicknessRatio	0.5;
	nSmoothSurfaceNormals	5;
	nSmoothThickness	10;
	minMedialAxisAngle	90.0;
	maxThicknessToMedialRatio	0.5;
	nMedialAxisIter	100;
	nSmoothNormals	3;
	slipFeatureAngle	30.0;
	nRelaxIter	5;
	nBufferCellsNoExtrude	0;
	nLayerIter	50;
	nRelaxedIter	20;
	detectExtrusionIsland	true;
}
meshQualityControls
{
	maxNonOrtho	65.0;
	maxBoundarySkewness	20.0;
	maxInternalSkewness	4.0;
	maxConcave	80.0;
	minVol	1.0E-14;
	minTetQuality	1.0E-20;
	minArea	-1.0;
	minTwist	0.02;
	minTriangleTwist	-1.0;
	minDeterminant	0.01;
	minFaceWeight	0.05;
	minVolRatio	0.01;
	minVolCollapseRatio	0.1;
	nSmoothScale	4;
	errorReduction	0.75;
	relaxed
	{
		maxNonOrtho	75.0;
	}
}
mergeTolerance	1.0E-6;
debug	0;
